{
  "id": "e3fc940a-8450-4be1-8ee5-73c49d3e6e3b",
  "conference": "IEEE Access",
  "year": 2017,
  "link": "https://doi.org/10.1109/ACCESS.2017.DOI",
  "domain": "AI",
  "title": "StructMamba: Structured Harmonic and Temporal Music Analysis via Dual-Axis Mamba and Attention",
  "summary": "StructMamba is a novel dual-axis architecture for music analysis that combines state-space modeling with two-dimensional attention.  It uses separate Mamba modules to model harmonic and rhythmic dependencies before fusing them through structured attention.  Evaluated on genre classification, onset detection, and structural segmentation, StructMamba outperforms existing CNN, transformer, and hybrid baselines, demonstrating both accuracy and interpretability.",
  "tags": "Music Information Retrieval, State Space Models, Mamba, Time-Frequency Modeling, Global Attention, Spectrograms, Deep Learning, Audio Analysis",
  "date_added": "2025-08-26T23:06:05",
  "ready_to_publish": false,
  "script": [
    "Male: Welcome to the podcast. Today we're discussing StructMamba, a groundbreaking approach to music analysis.",
    "Female: Exactly! It tackles the challenge of modeling music's complex harmonic and rhythmic structures.",
    "Male:  The key innovation is its dual-axis architecture, using separate Mamba modules for frequency and time.",
    "Female:  This allows for independent learning of harmonic progressions and rhythmic patterns.",
    "Male: Then, a global 2D attention mechanism fuses these representations, capturing long-range dependencies.",
    "Female:  This results in a model that's both highly accurate and surprisingly interpretable.",
    "Male:  Outperforming existing methods on benchmark tasks like genre classification...",
    "Female: ...and onset detection, demonstrating its effectiveness.",
    "Male:  But the real strength lies in its interpretability.  We can actually see how it aligns with music theory.",
    "Female: Yes, it identifies motifs, downbeats, and sectional boundaries, offering unique insights.",
    "Male: StructMamba is a significant step forward in music AI, promising advancements in music education and production.",
    "Female: Absolutely.  Its efficiency and interpretability make it a powerful tool for a wide range of applications."
  ]
}